In [1]:
# Import Libraries 
# data processing, CSV file I/O (e.g. pd.read_csv)
import pandas as pd 
# linear algebra
import numpy as np 
import numpy
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler, MinMaxScaler
import category_encoders as ce

import plotly
import plotly.express as ex
import plotly.graph_objs as go
from pathlib import Path
from sqlalchemy import extract
from sqlalchemy import create_engine
#import psycopg2

#from config import db_password

#for Machine learning 
from sklearn.model_selection import train_test_split
from sklearn.ensemble import GradientBoostingClassifier,RandomForestClassifier
from sklearn.linear_model import LogisticRegression
from sklearn.neighbors import KNeighborsClassifier
from sklearn import tree,svm
from sklearn.metrics import accuracy_score

In [2]:
# Retrieve Data for analysis
train = pd.read_csv('Resources_2/train.csv',index_col= None)
train_b = train.drop('PassengerId', axis=1,inplace=True)
test = pd.read_csv('Resources_2/test.csv',index_col= None)

In [ ]:
# Create connection string.
db_string = f"postgresql://postgres:{db_password}@postgress-1.caahnjhin4st.us-east-1.rds.amazonaws.com/happyhour"
    
# Generate engine.
engine = create_engine(db_string)

In [ ]:
# Retrieve table (Postgres).
train = pd.read_sql_table('train', engine, index_col=None)
test = pd.read_sql_table('test', engine, index_col=None)

In [3]:
# fill missing values of datasets by using "bfill" method.
train = train.fillna(method='bfill')
train = train.fillna(method='ffill')
test = test.fillna(method='bfill')
test = test.fillna(method='ffill')

In [4]:
#Change Cabin numbers like C-100 ,A-200 into A , C.  
train['Cabin']=train['Cabin'].str[0:1]
test['Cabin']=test['Cabin'].str[0:1]

In [5]:
#Encode columns into categorical features. 
le = LabelEncoder()
le = le.fit(train['Sex'])
train['Sex'] = le.transform(train['Sex'])
test['Sex'] = le.transform(test['Sex'])
le = le.fit(train['Cabin'])
train['Cabin'] = le.transform(train['Cabin'])
test['Cabin'] = le.transform(test['Cabin'])
le = le.fit(train['Embarked'])
train['Embarked'] = le.transform(train['Embarked'])
test['Embarked'] = le.transform(test['Embarked'])

In [6]:
# X_Train broken into 5 intervals
#train['fare_group']=pd.qcut(train['Fare'],5)
# X_Test
#test['fare_group']=pd.qcut(test['Fare'],5)

In [7]:
## Generate a column holding passengers as numerical values based on'title'
# convert passengers into numerical values using pro-noun and title 
## X_Train
#title=[]
#for i in range(len(train)):
#    title.append(train['Name'].iloc[i].split(',')[1].split('.')[0])
#train['title']=title
# convert pro-nouns to 'Who Cares'
#train['title']=train['title'].replace([' Col',' Major',' Mlle',' Ms',' the Countess',' Capt',' Lady',' Mme',' Sir',' Don','Dona',' Jonkheer'],'Who Cares')
# convert 'Who Cares' to numerical values
#train['title']=train['title'].replace({' Mr':1,' Mrs':2,' Miss':3,' Master':4,'Who Cares':5,' Dr':6,' Rev':5})
## X_Test
#title=[]
#for i in range(len(test)):
#    title.append(test['Name'].iloc[i].split(',')[1].split('.')[0])
#test['title']=title
#
#test['title']=test['title'].replace([' Col',' Major',' Mlle',' Ms',' the Countess',' Capt',' Lady',' Mme',' Sir',' Don','Dona',' Jonkheer'],'Who Cares')
#
#test['title']=test['title'].replace({' Mr':1,' Mrs':2,' Miss':3,' Master':4,'Who Cares':5,' Dr':6,' Rev':5})

In [8]:
# get the square root of 'Fare' 
# X_Train
train['Fare']=np.sqrt(train['Fare'])
# X_Test
test['Fare']=np.sqrt(test['Fare'])

In [9]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Name      891 non-null    object
 3   Sex       891 non-null    int32
 4   Age       891 non-null    float64
 5   SibSp     891 non-null    int64
 6   Parch     891 non-null    int64
 7   Ticket    891 non-null    object
 8   Fare      891 non-null    float64
 9   Cabin     891 non-null    int32
 10  Embarked  891 non-null    int32
dtypes: float64(2), int32(3), int64(4), object(2)
memory usage: 66.3+ KB

In [10]:
# data statistics 
train.describe()

,Survived,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000,891.000000
mean,0.383838,2.308642,0.647587,29.870561,0.523008,0.381594,4.851220,2.411897,1.534231
std,0.486592,0.836071,0.477990,14.597668,1.102743,0.806057,2.946119,1.465649,0.793021
min,0.000000,1.000000,0.000000,0.420000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,0.000000,2.000000,0.000000,21.000000,0.000000,0.000000,2.812542,1.000000,1.000000
50%,0.000000,3.000000,1.000000,29.000000,0.000000,0.000000,3.801868,2.000000,2.000000
75%,1.000000,3.000000,1.000000,39.000000,1.000000,0.000000,5.567764,3.000000,2.000000
max,1.000000,3.000000,1.000000,80.000000,8.000000,6.000000,22.634690,7.000000,2.000000

In [11]:
train

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",1,22.0,1,0,A/5 21171,2.692582,2,2
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,38.0,1,0,PC 17599,8.442944,2,0
2,1,3,"Heikkinen, Miss. Laina",0,26.0,0,0,STON/O2. 3101282,2.815138,2,2
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,35.0,1,0,113803,7.286975,2,2
4,0,3,"Allen, Mr. William Henry",1,35.0,0,0,373450,2.837252,4,2
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",1,27.0,0,0,211536,3.605551,1,2
887,1,1,"Graham, Miss. Margaret Edith",0,19.0,0,0,112053,5.477226,1,2
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",0,26.0,1,2,W./C. 6607,4.842520,2,2
889,1,1,"Behr, Mr. Karl Howell",1,26.0,0,0,111369,5.477226,2,0
890,0,3,"Dooley, Mr. Patrick",1,32.0,0,0,370376,2.783882,2,1

In [12]:
test

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",1,34.5,0,0,330911,2.798071,1,1
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",0,47.0,1,0,363272,2.645751,1,2
2,894,2,"Myles, Mr. Thomas Francis",1,62.0,0,0,240276,3.112475,1,1
3,895,3,"Wirz, Mr. Albert",1,27.0,0,0,315154,2.943213,1,2
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",0,22.0,1,1,3101298,3.505353,1,2
...,...,...,...,...,...,...,...,...,...,...,...
413,1305,3,"Spector, Mr. Woolf",1,39.0,0,0,A.5. 3236,2.837252,2,2
414,1306,1,"Oliva y Ocana, Dona. Fermina",0,39.0,0,0,PC 17758,10.435516,2,0
415,1307,3,"Saether, Mr. Simon Sivertsen",1,38.5,0,0,SOTON/O.Q. 3101262,2.692582,2,2
416,1308,3,"Ware, Mr. Frederick",1,38.5,0,0,359309,2.837252,2,2
417,1309,3,"Peter, Master. Michael J",1,38.5,1,1,2668,4.728456,2,0

In [14]:
x_train= train.iloc[:,[1,3,4,5,6,8,9,10]].astype("int64")
y_train= train.iloc[:,[0]].astype("int64")
x_train

     Pclass  Sex  Age  SibSp  Parch  Fare  Cabin  Embarked
0         3    1   22      1      0     2      2         2
1         1    0   38      1      0     8      2         0
2         3    0   26      0      0     2      2         2
3         1    0   35      1      0     7      2         2
4         3    1   35      0      0     2      4         2
..      ...  ...  ...    ...    ...   ...    ...       ...
886       2    1   27      0      0     3      1         2
887       1    0   19      0      0     5      1         2
888       3    0   26      1      2     4      2         2
889       1    1   26      0      0     5      2         0
890       3    1   32      0      0     2      2         1

[891 rows x 8 columns]

In [15]:
y_train

     Survived
0           0
1           1
2           1
3           1
4           0
..        ...
886         0
887         1
888         0
889         1
890         0

[891 rows x 1 columns]

In [16]:
check_df=pd.concat([x_train,y_train],axis=1)
check_df.corr()

,Pclass,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked,Survived
Pclass,1.000000,0.131900,-0.295486,0.083081,0.018443,-0.681963,0.089610,0.166223,-0.338481
Sex,0.131900,1.000000,0.060747,-0.114631,-0.245489,-0.240662,0.005350,0.111894,-0.543351
Age,-0.295486,0.060747,1.000000,-0.204276,-0.161242,0.100433,-0.033178,-0.027802,-0.055359
SibSp,0.083081,-0.114631,-0.204276,1.000000,0.414838,0.264398,0.036189,0.069444,-0.035322
Parch,0.018443,-0.245489,-0.161242,0.414838,1.000000,0.291909,-0.000994,0.041064,0.081629
Fare,-0.681963,-0.240662,0.100433,0.264398,0.291909,1.000000,-0.088927,-0.214308,0.315949
Cabin,0.089610,0.005350,-0.033178,0.036189,-0.000994,-0.088927,1.000000,0.051175,-0.004520
Embarked,0.166223,0.111894,-0.027802,0.069444,0.041064,-0.214308,0.051175,1.000000,-0.170943
Survived,-0.338481,-0.543351,-0.055359,-0.035322,0.081629,0.315949,-0.004520,-0.170943,1.000000

In [17]:
x_test=test.iloc[:,[1,3,4,5,6,8,9,10]]
x_test

     Pclass  Sex   Age  SibSp  Parch       Fare  Cabin  Embarked
0         3    1  34.5      0      0   2.798071      1         1
1         3    0  47.0      1      0   2.645751      1         2
2         2    1  62.0      0      0   3.112475      1         1
3         3    1  27.0      0      0   2.943213      1         2
4         3    0  22.0      1      1   3.505353      1         2
..      ...  ...   ...    ...    ...        ...    ...       ...
413       3    1  39.0      0      0   2.837252      2         2
414       1    0  39.0      0      0  10.435516      2         0
415       3    1  38.5      0      0   2.692582      2         2
416       3    1  38.5      0      0   2.837252      2         2
417       3    1  38.5      1      1   4.728456      2         0

[418 rows x 8 columns]

In [18]:
#Normalize data from 0 to 1 by using StandardScaler
x_train = StandardScaler().fit_transform(x_train)
x_test = StandardScaler().fit_transform(x_test)

In [19]:
#Let's fit and predict.
forest = RandomForestClassifier(n_estimators=200, random_state=2, max_depth=300)
forest.fit(x_train, y_train)
model_score=forest.score(x_train, y_train)

<ipython-input-19-924c38f544d9>:3: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  forest.fit(x_train, y_train)

In [20]:
print("Model Score = ", model_score)

Model Score =  0.9865319865319865

In [21]:
y_pred=forest.predict(x_test)

In [22]:
y_pred2= pd.DataFrame(y_pred)
y_pred2["Survived"]= y_pred2[0]
y_pred2=y_pred2.iloc[:,[1]].astype("int")
y_pred2

     Survived
0           0
1           0
2           0
3           0
4           0
..        ...
413         1
414         1
415         1
416         1
417         0

[418 rows x 1 columns]

In [23]:
#Connect test data and prediction data 
result=pd.concat([test,y_pred2],axis=1)
result=result.iloc[:,[0,11]]
result

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
..           ...       ...
413         1305         1
414         1306         1
415         1307         1
416         1308         1
417         1309         0

[418 rows x 2 columns]

In [ ]:
#make an output csv file as submission.csv
result.to_csv('random_forest.csv', index=False)